app/controllers/api/v1/employees_controller.rb

INSERT INTO "employees" ("country", "created_at", "currency", "department", "email", "hire_date", "job_title", "name", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
      def create
        employee = Employee.new(employee_params)
        if employee.save

UPDATE "employees" SET "name" = $1, "status" = $2, "updated_at" = $3 WHERE "employees"."id" = $4  [["name", "New Name"], ["status", "terminated"], ["updated_at", "2026-09-22 17:10:52.580115"], ["id", 742]]
---
      def update
        if @employee.update(employee_params)

SELECT "salary_records".* FROM "salary_records" WHERE "salary_records"."employee_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25)
SELECT "employees".* FROM "employees" ORDER BY "employees"."id" ASC LIMIT $1  [["LIMIT", 1000]]
SELECT "salary_records".* FROM "salary_records" WHERE "salary_records"."employee_id" = $1  [["employee_id", 2948]]
---
      def export
        employees = Employee.includes(:salary_records).order(:name)
        csv = CSV.generate(headers: true) do |builder|
          builder << %w[
            name email job_title department country currency status hire_date
            salary_amount salary_frequency salary_effective_date
          ]
          employees.find_each do |employee|