app/controllers/api/v1/meta_controller.rb

SELECT DISTINCT "employees"."department" FROM "employees" ORDER BY "employees"."department" ASC
---
      def departments
        render json: { departments: Employee.distinct.order(:department).pluck(:department) }

SELECT DISTINCT "employees"."country" FROM "employees" ORDER BY "employees"."country" ASC
---
      def countries
        render json: { countries: Employee.distinct.order(:country).pluck(:country) }