app/controllers/api/v1/salary_records_controller.rb

INSERT INTO "salary_records" ("amount", "created_at", "currency", "effective_date", "employee_id", "frequency", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
      def create
        record = @employee.salary_records.new(salary_record_params)
        carry_over_breakdown(record) if record.salary_components.empty?

        if record.save

SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 744], ["LIMIT", 1]]
---
      def set_employee
        @employee = Employee.find(params[:employee_id])